-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Сен 11 2017 г., 11:50
-- Версия сервера: 5.5.53
-- Версия PHP: 5.6.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `shop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `category`
--

CREATE TABLE `category` (
  `id` int(10) UNSIGNED NOT NULL,
  `parent_id` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `name` varchar(255) NOT NULL,
  `keywords` varchar(255) DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `category`
--

INSERT INTO `category` (`id`, `parent_id`, `name`, `keywords`, `description`) VALUES
(1, 0, 'Sportswear', NULL, NULL),
(2, 0, 'Mens', NULL, NULL),
(3, 0, 'Womens', NULL, NULL),
(4, 1, 'Nike', NULL, NULL),
(5, 1, 'Under Armour', NULL, NULL),
(6, 1, 'Adidas', NULL, NULL),
(7, 1, 'Puma', NULL, NULL),
(8, 1, 'ASICS', NULL, NULL),
(9, 2, 'Fendi', NULL, NULL),
(10, 2, 'Guess', NULL, NULL),
(11, 2, 'Valentino', NULL, NULL),
(12, 2, 'Dior', NULL, NULL),
(13, 2, 'Versace', NULL, NULL),
(14, 2, 'Armani', NULL, NULL),
(15, 2, 'Prada', NULL, NULL),
(16, 2, 'Dolce and Gabbana', NULL, NULL),
(17, 2, 'Chanel', NULL, NULL),
(18, 2, 'Gucci', NULL, NULL),
(19, 3, 'Fendi', NULL, NULL),
(20, 3, 'Guess', NULL, NULL),
(21, 3, 'Valentino', NULL, NULL),
(22, 3, 'Dior', NULL, NULL),
(23, 3, 'Versace', NULL, NULL),
(24, 0, 'Kids', NULL, NULL),
(25, 0, 'Fashion', NULL, NULL),
(26, 0, 'Households', NULL, NULL),
(27, 0, 'Interiors', NULL, NULL),
(28, 0, 'Clothing', NULL, NULL),
(29, 0, 'Bags', 'сумки ключевики...', 'сумки описание...'),
(30, 0, 'Shoes', NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `image`
--

CREATE TABLE `image` (
  `id` int(11) NOT NULL,
  `filePath` varchar(400) NOT NULL,
  `itemId` int(11) DEFAULT NULL,
  `isMain` tinyint(1) DEFAULT NULL,
  `modelName` varchar(150) NOT NULL,
  `urlAlias` varchar(400) NOT NULL,
  `name` varchar(80) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `image`
--

INSERT INTO `image` (`id`, `filePath`, `itemId`, `isMain`, `modelName`, `urlAlias`, `name`) VALUES
(1, 'Products/Product1/b62efb.jpg', 1, 0, 'Product', 'a431fa3150-3', ''),
(2, 'Products/Product2/b9e48a.jpg', 2, 0, 'Product', 'd6275ef2a9-2', ''),
(3, 'Products/Product2/5cb6d2.jpg', 2, 0, 'Product', '03ea0bcfa7-3', ''),
(4, 'Products/Product2/b9df28.jpg', 2, 0, 'Product', 'ce35022e0d-4', ''),
(5, 'Products/Product2/b25e2d.jpg', 2, 0, 'Product', 'b133ada403-5', ''),
(6, 'Products/Product3/ba82f8.jpg', 3, 0, 'Product', 'b72e9dddc9-2', ''),
(7, 'Products/Product3/a49785.jpg', 3, 0, 'Product', '47ce4e4565-3', ''),
(8, 'Products/Product3/0c0baa.jpg', 3, 0, 'Product', '2769836981-4', ''),
(9, 'Products/Product3/8f9c7a.jpg', 3, 0, 'Product', '7aa298328d-5', ''),
(10, 'Products/Product1/98918a.png', 1, 0, 'Product', '6e1c8e0ef2-4', ''),
(11, 'Products/Product2/eaa86d.png', 2, 1, 'Product', 'cb1ad2a113-1', ''),
(12, 'Products/Product1/88d120.png', 1, 0, 'Product', 'f8bdcf2883-5', ''),
(13, 'Products/Product1/8b2d67.png', 1, 0, 'Product', '4b6c3dffe4-2', ''),
(14, 'Products/Product3/890bc2.png', 3, 1, 'Product', 'c7a6072e85-1', ''),
(15, 'Products/Product1/27596b.png', 1, 1, 'Product', '3a94756ba8-1', '');

-- --------------------------------------------------------

--
-- Структура таблицы `migration`
--

CREATE TABLE `migration` (
  `version` varchar(180) NOT NULL,
  `apply_time` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `migration`
--

INSERT INTO `migration` (`version`, `apply_time`) VALUES
('m000000_000000_base', 1498950259),
('m140622_111540_create_image_table', 1498950269),
('m140622_111545_add_name_to_image_table', 1498950269);

-- --------------------------------------------------------

--
-- Структура таблицы `order`
--

CREATE TABLE `order` (
  `id` int(10) UNSIGNED NOT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  `qty` int(10) NOT NULL,
  `sum` float NOT NULL,
  `status` enum('0','1') NOT NULL DEFAULT '0',
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `address` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `order`
--

INSERT INTO `order` (`id`, `created_at`, `updated_at`, `qty`, `sum`, `status`, `name`, `email`, `phone`, `address`) VALUES
(1, '2017-06-20 00:13:12', '2017-06-20 00:13:12', 19, 736, '1', 'Юра', 'master1414@outllok.com', '02', 'Ukraine'),
(2, '2017-06-20 00:15:31', '2017-06-23 00:15:31', 7, 402, '1', 'Юра', 'master1414@outllok.com', '02', 'Odessa'),
(3, '2017-06-20 00:29:45', '2017-06-20 00:29:45', 4, 282, '0', 'Иван', 'master1414@outllok.com', '03', 'Киев'),
(4, '2017-06-20 00:30:50', '2017-06-20 00:30:50', 4, 282, '0', 'Иван', 'master1414@outllok.com', '03', 'Киев'),
(5, '2017-06-20 21:25:27', '2017-06-20 21:25:27', 3, 146, '0', 'Юра', 'test@y.loc', '02', 'Киев'),
(6, '2017-06-20 21:28:08', '2017-06-20 21:28:08', 3, 146, '0', 'Юра', 'test@y.loc', '02', 'Киев'),
(7, '2017-06-20 21:33:19', '2017-06-20 21:33:19', 1, 56, '0', 'Юра', 'test@y.loc', '03', 'Ukraine'),
(8, '2017-06-20 21:42:28', '2017-06-20 21:42:28', 1, 20, '0', 'Юра', 'test@y.loc', '03', 'Ukraine'),
(9, '2017-06-20 21:59:47', '2017-06-20 21:59:47', 1, 56, '0', 'Юра', 'test@y.loc', '02', 'Ukraine'),
(10, '2017-06-20 22:05:31', '2017-06-20 22:05:31', 1, 20, '0', 'Юра', 'test@y.loc', '02', 'Ukraine'),
(11, '2017-06-20 22:10:24', '2017-06-20 22:10:24', 1, 70, '0', 'Юра', 'test@y.loc', '02', 'Ukraine'),
(12, '2017-06-20 22:29:47', '2017-06-20 22:29:47', 2, 40, '0', 'Юра', 'test@y.loc', '02', 'Ukraine'),
(13, '2017-06-20 22:36:37', '2017-06-20 22:36:37', 1, 56, '0', 'Юра', 'test@y.loc', '02', 'Ukraine'),
(14, '2017-06-20 22:40:39', '2017-06-20 22:40:39', 1, 70, '0', 'Юра', 'test@y.loc', '02', 'Ukraine'),
(15, '2017-06-20 22:42:38', '2017-06-20 22:42:38', 1, 70, '0', 'Юра', 'test@y.loc', '02', 'Ukraine'),
(16, '2017-06-20 22:42:45', '2017-06-20 22:42:45', 1, 70, '0', 'Юра', 'test@y.loc', '02', 'Ukraine'),
(17, '2017-06-20 22:43:48', '2017-06-20 22:43:48', 1, 70, '0', 'Юра', 'test@y.loc', '02', 'Ukraine'),
(18, '2017-06-20 22:46:00', '2017-06-20 22:46:00', 1, 70, '0', 'Юра', 'test@y.loc', '02', 'Ukraine'),
(19, '2017-06-20 22:48:25', '2017-06-20 22:48:25', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(20, '2017-06-20 22:49:05', '2017-06-20 22:49:05', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(21, '2017-06-20 22:55:15', '2017-06-20 22:55:15', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(22, '2017-06-20 23:01:33', '2017-06-20 23:01:33', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(23, '2017-06-20 23:05:02', '2017-06-20 23:05:02', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(24, '2017-06-20 23:05:58', '2017-06-20 23:05:58', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(25, '2017-06-20 23:06:43', '2017-06-20 23:06:43', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(26, '2017-06-20 23:08:06', '2017-06-20 23:08:06', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(27, '2017-06-20 23:08:46', '2017-06-20 23:08:46', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(28, '2017-06-20 23:09:28', '2017-06-20 23:09:28', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(29, '2017-06-20 23:10:00', '2017-06-20 23:10:00', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(30, '2017-06-20 23:10:25', '2017-06-20 23:10:25', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(31, '2017-06-20 23:10:50', '2017-06-20 23:10:50', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(32, '2017-06-20 23:11:31', '2017-06-20 23:11:31', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(33, '2017-06-20 23:12:38', '2017-06-20 23:12:38', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(34, '2017-06-20 23:13:07', '2017-06-20 23:13:07', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(35, '2017-06-20 23:23:10', '2017-06-20 23:23:10', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(36, '2017-06-20 23:23:39', '2017-06-20 23:23:39', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(37, '2017-06-20 23:23:52', '2017-06-20 23:23:52', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(38, '2017-06-20 23:24:19', '2017-06-20 23:24:19', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(39, '2017-06-20 23:29:08', '2017-06-20 23:29:08', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(40, '2017-06-20 23:30:40', '2017-06-20 23:30:40', 1, 70, '0', 'Иван', 'test@y.loc', '02', 'Ukraine'),
(41, '2017-06-20 23:38:10', '2017-06-20 23:38:10', 1, 20, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(42, '2017-06-20 23:41:28', '2017-06-20 23:41:28', 1, 20, '0', 'Юра', 'tankist@3g.ua', '03', 'Ukraine'),
(43, '2017-06-20 23:47:23', '2017-06-20 23:47:23', 1, 56, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(44, '2017-06-20 23:47:45', '2017-06-20 23:47:45', 1, 56, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(45, '2017-06-20 23:48:27', '2017-06-20 23:48:27', 1, 56, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(46, '2017-06-20 23:50:57', '2017-06-20 23:50:57', 1, 56, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(47, '2017-06-21 00:01:11', '2017-06-21 00:01:11', 1, 70, '0', 'Иван', 'master1515@outllok.com', '03', 'Киев'),
(48, '2017-06-21 00:01:36', '2017-06-21 00:01:36', 1, 70, '0', 'Иван', 'master1515@outllok.com', '03', 'Киев'),
(49, '2017-06-21 10:37:19', '2017-06-21 10:37:19', 1, 70, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(50, '2017-06-21 11:10:38', '2017-06-21 11:10:38', 1, 70, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(51, '2017-06-21 11:12:07', '2017-06-21 11:12:07', 1, 70, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(52, '2017-06-21 11:13:17', '2017-06-21 11:13:17', 1, 70, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(53, '2017-06-21 11:14:31', '2017-06-21 11:14:31', 1, 70, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(54, '2017-06-21 11:15:27', '2017-06-21 11:15:27', 1, 70, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(55, '2017-06-21 11:16:23', '2017-06-21 11:16:23', 1, 70, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine'),
(56, '2017-06-21 11:21:03', '2017-06-21 11:21:03', 1, 70, '0', 'Юра', 'tankist@3g.ua', '02', 'Ukraine');

-- --------------------------------------------------------

--
-- Структура таблицы `order_items`
--

CREATE TABLE `order_items` (
  `id` int(10) UNSIGNED NOT NULL,
  `order_id` int(10) UNSIGNED NOT NULL,
  `product_id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `price` float NOT NULL,
  `qty_item` int(11) NOT NULL,
  `sum_item` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `order_items`
--

INSERT INTO `order_items` (`id`, `order_id`, `product_id`, `name`, `price`, `qty_item`, `sum_item`) VALUES
(1, 1, 6, 'Кардиган Levi\'s Icy Grey Heather M', 100, 1, 100),
(2, 1, 1, 'Джинсы Garcia 244/32/856 28-32 р Серо-синие', 10, 10, 100),
(3, 1, 10, 'Сумка GUSSACI TUGUS13A060-3-10', 15, 5, 75),
(4, 1, 11, 'Сумка Michael Kors Jet Set Travel Нежно-розовая Michael Kors Jet Set Travel Нежно-розовая', 200, 1, 200),
(5, 1, 12, 'Сумка Michael Kors Selma Золотистая Michael Kors Selma Золотистая', 205, 1, 205),
(6, 1, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 1, 56),
(7, 2, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 2, 112),
(8, 2, 7, 'Кардиган ONLY ON 15102048 M Black Tan/Partridg', 0, 1, 0),
(9, 2, 6, 'Кардиган Levi\'s Icy Grey Heather M', 100, 2, 200),
(10, 2, 3, 'Блуза Mango 53005681-05 M Бежевая', 20, 1, 20),
(11, 2, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(12, 4, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 2, 112),
(13, 4, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(14, 4, 6, 'Кардиган Levi\'s Icy Grey Heather M', 100, 1, 100),
(15, 5, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 1, 56),
(16, 5, 3, 'Блуза Mango 53005681-05 M Бежевая', 20, 1, 20),
(17, 5, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(18, 6, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 1, 56),
(19, 6, 3, 'Блуза Mango 53005681-05 M Бежевая', 20, 1, 20),
(20, 6, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(21, 7, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 1, 56),
(22, 8, 3, 'Блуза Mango 53005681-05 M Бежевая', 20, 1, 20),
(23, 9, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 1, 56),
(24, 10, 3, 'Блуза Mango 53005681-05 M Бежевая', 20, 1, 20),
(25, 11, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(26, 12, 3, 'Блуза Mango 53005681-05 M Бежевая', 20, 2, 40),
(27, 13, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 1, 56),
(28, 14, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(29, 15, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(30, 16, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(31, 17, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(32, 18, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(33, 19, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(34, 20, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(35, 21, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(36, 22, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(37, 23, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(38, 24, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(39, 25, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(40, 26, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(41, 27, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(42, 28, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(43, 29, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(44, 30, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(45, 31, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(46, 32, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(47, 33, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(48, 34, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(49, 35, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(50, 36, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(51, 37, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(52, 38, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(53, 39, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(54, 40, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(55, 41, 3, 'Блуза Mango 53005681-05 M Бежевая', 20, 1, 20),
(56, 42, 3, 'Блуза Mango 53005681-05 M Бежевая', 20, 1, 20),
(57, 43, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 1, 56),
(58, 44, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 1, 56),
(59, 45, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 1, 56),
(60, 46, 2, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', 56, 1, 56),
(61, 47, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(62, 48, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(63, 49, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(64, 50, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(65, 51, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(66, 52, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(67, 53, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(68, 54, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(69, 55, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70),
(70, 56, 4, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', 70, 1, 70);

-- --------------------------------------------------------

--
-- Структура таблицы `product`
--

CREATE TABLE `product` (
  `id` int(10) UNSIGNED NOT NULL,
  `category_id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `content` text,
  `price` float NOT NULL DEFAULT '0',
  `keywords` varchar(255) DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL,
  `img` varchar(255) DEFAULT 'no-image.png',
  `hit` enum('0','1') NOT NULL DEFAULT '0',
  `new` enum('0','1') NOT NULL DEFAULT '0',
  `sale` enum('0','1') NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `product`
--

INSERT INTO `product` (`id`, `category_id`, `name`, `content`, `price`, `keywords`, `description`, `img`, `hit`, `new`, `sale`) VALUES
(1, 4, 'Джинсы Garcia 244/32/856 28-32 р Серо-синие', 'Великолепные джинсы винтажно-голубого цвета. Настоящая находка для любителей качественного денима.\n\nОсобенности:\n\n    Зауженные к низу\n    Пять карманов\n    Высококачественный деним\n    Высокая посадка (high fit)\n    Выгодно подчеркивают фигуру', 10, NULL, NULL, 'product1.jpg', '0', '0', '0'),
(2, 4, 'Джинсы MR520 MR 227 20002 0115 29-34 р Синие', '\n\nMR520 – амбициозный восточноевропейский бренд, который предлагает качественную и стильную одежду, сделанную специально для молодых людей, следящих за своим внешним видом.\n\nЖенские джинсы фасона boyfriend fit (в переводе с англ. – \"джинсы моего парня\"). Модель с зауженными штанинами. Застегивается на пуговицы. Изделие с низкой посадкой. Джинсы дополнены прорезными карманами спереди и накладными карманами сзади.\n\nИзделие декорировано эффектом потертости, вареным эффектом и необычными швами.\n', 56, NULL, NULL, 'product2.jpg', '1', '0', '0'),
(3, 9, 'Блуза Mango 53005681-05 M Бежевая', 'Испанский бренд модной одежды \"Mango\" родился в 1984 году в Барселоне, где и по сей день находится штаб-квартира компании. В том же городе появился и первый магазин — на улице Пасео де Грасия (Paseo de Gracia). Компания, основанная братьями Исааком и Нахманом Андиком (Isaac & Nahman Andic), очень быстро набрала популярность — всего лишь годом позднее был открыт магазин в другом городе, на этот раз в Валенсии. Одежда \"Mango\" отличается высоким качеством, приемлемой ценой, современным дизайном и неповторимым стилем.', 20, NULL, NULL, 'product3.jpg', '1', '1', '0'),
(4, 21, 'Блуза Tom Tailor TT 20312490071 7610 M Зелёная', '\r\n\r\nTom Tailor Group — один из ведущих и быстро развивающихся Fashion холдингов германии и европы, продукция которого ориентирована на целевую аудиторию в возрасте от 0 до 60 лет.\r\n\r\nTom Tailor известен на рынке текстиля с 1962 года и до сих пор сохраняет стандарты немецкого качества. Tom Tailor предлагает повседневную одежду и аксессуары высокого качества для женщин, мужчин и детей.\r\n\r\nОдежда от Tom Tailor поможет создать активный повседневный образ с нотками элегантности.', 70, NULL, NULL, 'product4.jpg', '1', '0', '1'),
(5, 25, 'Блузка Kira Plastinina 17-16-17453-SM-29 S', NULL, 0, NULL, NULL, 'product5.jpg', '1', '0', '0'),
(6, 28, 'Кардиган Levi\'s Icy Grey Heather M', NULL, 100, NULL, NULL, 'product6.jpg', '1', '0', '0'),
(7, 28, 'Кардиган ONLY ON 15102048 M Black Tan/Partridg', '\r\n\r\nCasual марка молодежной женской одежды ONLY является частью датской компании Bestseller AS. Изначально Bestseller занимался производством детской одежды, а в 1995 году появилась на свет марка ONLY. Популярность этой марки возрастала быстрыми темпами и теперь ONLY владеет 770 магазинами в более чем 40 странах мира.\r\n\r\nONLY — бренд стильной молодежной одежды. Это бренд для тех, кто любит добиваться успеха и быть не таким, как все. Демократичные цены, модные модели, экологически чистые ткани делают одежду от ONLY сверхпопулярной.', 0, NULL, NULL, 'no-image.png', '1', '1', '0'),
(8, 26, 'Брюки SK House 2211-1972кор L Коричневые', '\r\n\r\nКомпания SK House — это украинский производитель модной женской одежды с безупречной репутацией и тысячами поклонников по всему СНГ. SK House изготавливает качественный и долговечный товар, созданный из высококачественных тканей. Компания использует современные методы пошива и, изучая текущие мировые тенденции и локальные требования покупателей, создает модели, которые не задерживаются на полках длительное время и быстро раскупаются во всех странах.', 99, NULL, NULL, 'no-image.png', '0', '0', '1'),
(9, 26, 'Брюки Kira Plastinina 17-07-17418-FL-58 L', NULL, 0, NULL, NULL, 'product1.jpg', '0', '0', '0'),
(10, 29, 'Сумка GUSSACI TUGUS13A060-3-10', 'Простота, инновационный стиль бренда, высококачественные требования к продукции, благодаря этому GUSSACI Italy пользуется высокой репутацией во многих странах Европы. Превосходное качество, отличный дизайн, соответствующие цены делают \"Гуссачи\" модным и популярным!\r\n\r\nОсобенности:\r\n\r\nКоличество основных отделений: 1. Сумка имеет прорезной карман на молнии, а также два небольших накладных кармана для хранения мобильного телефона, разных портативных гаджетов и мелочей. На лицевой стороне модели есть узкий прорезной карман на \"молнии\". На тыльной стороне модели есть прорезной карман на \"молнии\". Особенностью данной модели является возможность изменения ее формы при помощи дополнительной внешней застежки-молнии. Сумка имеет 2 ручки для переноса на локте или в руке. Их длина не регулируется и составляет 45 см, а высота от крайней точки ручки до сумки — 16 см. В комплект к изделию прилагается съемный плечевой ремень. Его длина может регулироваться при помощи металлической пряжки от 78 до 137.5 см. Сумка закрывается при помощи застежки-молнии.\r\n\r\nМатериал подкладки: плотная ткань.\r\nМатериал сумки: кожезаменитель.\r\nЦвет фурнитуры: золото.\r\nРазмеры сумки: 26 х 25 х 10.5 см', 15, NULL, NULL, 'product3.jpg', '0', '1', '0'),
(11, 29, 'Cумка Michael Kors Jet Set Travel Нежно-розовая', '\r\n\r\nОсобенность стиля Michael Kors заключается в том, что простота его коллекций гармонирует с роскошью. Этому дизайнеру под силу объединить американский утилитаризм в манере одеваться с европейской изысканностью и шармом. Все его работы отличает изящная утонченность, которая рождается из строгих, почти примитивных линий. Все аксессуары поддерживают общий стиль человека с безупречным вкусом.\r\n\r\nМодели Michael Kors могут оставаться оригинальными, стильными и неотразимыми в течение многих лет, что особо важно для покупательниц, не желающих постоянно обновлять свой гардероб.', 200, NULL, NULL, 'no-image.png', '0', '0', '1'),
(12, 29, 'Cумка Michael Kors Selma Золотистая', '\r\n\r\nОсобенность стиля Michael Kors заключается в том, что простота его коллекций гармонирует с роскошью. Этому дизайнеру под силу объединить американский утилитаризм в манере одеваться с европейской изысканностью и шармом. Все его работы отличает изящная утонченность, которая рождается из строгих, почти примитивных линий. Все аксессуары поддерживают общий стиль человека с безупречным вкусом.\r\n\r\nМодели Michael Kors могут оставаться оригинальными, стильными и неотразимыми в течение многих лет, что особо важно для покупательниц, не желающих постоянно обновлять свой гардероб.', 205, NULL, NULL, 'product5.jpg', '0', '0', '0'),
(13, 29, 'Cумка Michael Kors Bedford Красная', '\r\n\r\nОсобенность стиля Michael Kors заключается в том, что простота его коллекций гармонирует с роскошью. Этому дизайнеру под силу объединить американский утилитаризм в манере одеваться с европейской изысканностью и шармом. Все его работы отличает изящная утонченность, которая рождается из строгих, почти примитивных линий. Все аксессуары поддерживают общий стиль человека с безупречным вкусом.\r\n\r\nМодели Michael Kors могут оставаться оригинальными, стильными и неотразимыми в течение многих лет, что особо важно для покупательниц, не желающих постоянно обновлять свой гардероб.', 0, NULL, NULL, 'no-image.png', '0', '0', '0'),
(14, 29, 'Cумка Michael Kors JS Travel Светло-розовая', '\r\n\r\nОсобенность стиля Michael Kors заключается в том, что простота его коллекций гармонирует с роскошью. Этому дизайнеру под силу объединить американский утилитаризм в манере одеваться с европейской изысканностью и шармом. Все его работы отличает изящная утонченность, которая рождается из строгих, почти примитивных линий. Все аксессуары поддерживают общий стиль человека с безупречным вкусом.\r\n\r\nМодели Michael Kors могут оставаться оригинальными, стильными и неотразимыми в течение многих лет, что особо важно для покупательниц, не желающих постоянно обновлять свой гардероб.', 0, NULL, NULL, 'no-image.png', '0', '0', '0');

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id` int(10) UNSIGNED NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `auth_key` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `username`, `password`, `auth_key`) VALUES
(1, 'admin', '$2y$13$TdsIbt5ajFRZoaMRTfMjL./zvoQAWJizJbAm8oQ8TlA.t5GuQ0hVa', 'CszQsbBer5Di-87KwR9rMBXpvBxxDCjq');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `image`
--
ALTER TABLE `image`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `migration`
--
ALTER TABLE `migration`
  ADD PRIMARY KEY (`version`);

--
-- Индексы таблицы `order`
--
ALTER TABLE `order`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `order_items`
--
ALTER TABLE `order_items`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `category`
--
ALTER TABLE `category`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;
--
-- AUTO_INCREMENT для таблицы `image`
--
ALTER TABLE `image`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;
--
-- AUTO_INCREMENT для таблицы `order`
--
ALTER TABLE `order`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=57;
--
-- AUTO_INCREMENT для таблицы `order_items`
--
ALTER TABLE `order_items`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=71;
--
-- AUTO_INCREMENT для таблицы `product`
--
ALTER TABLE `product`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
